{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "GULF",
    "1": "LEV",
    "2": "NA",
    "3": "NILE",
    "4": "IRAQ",
    "5": "YEM",
    "6": "MSA"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "GULF": 0,
    "IRAQ": 4,
    "LEV": 1,
    "MSA": 6,
    "NA": 2,
    "NILE": 3,
    "YEM": 5
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 29757,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.56.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 64000
}
